cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/games"
tap "homebrew/php"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "tldr-pages/tldr"

# First, java
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Packages
brew "autoconf"
brew "boost"
brew "cmake"
brew "composer"
brew "coreutils"
brew "curl"
brew "freetype"
brew "frotz"
brew "git-credential-manager"
brew "git-flow"
brew "gnutls"
brew "gource"
brew "htop"
brew "maven"
brew "mongodb"
brew "mysql"
brew "neovim"
brew "node", link: false
brew "nvm"
brew "ranger"
brew "swiftlint"
brew "tmux"
brew "ultralist"
brew "watchman"
brew "yarn"
brew "z"
brew "zsh"
cask "hyper"
